import 'package:tecno_blog/models/data_models.dart';

Map homePageBannerMap = {
  "imageAsset": "assets/images/banners/programming.png",
  "writer": "ملیکا عزیزی",
  "date": "یک روز پیش",
  "title": "دوازده قدم اول برنامه نویسی",
  "view": "156",
};

List<HashTag> tagList = [
  HashTag(title: 'جاوا'),
  HashTag(title: 'برنامه نویسی دارت'),
  HashTag(title: 'طراحی سایت'),
  HashTag(title: 'پادکست ها'),
  HashTag(title: 'بازی سازی'),
  HashTag(title: 'پایتون'),
];

List<BlogModel> blogList = [
  BlogModel(
    id: 1,
    imageUrl:
        'https://static.roocket.ir/images/cover/2025/10/23/EzP5qJBwQqQp0PcmKo17RndZeHMFEO5rPbNeoxyq.webp',
    writer: 'ارسطو عباسی',
    writerImageUrl:
        'https://static.roocket.ir/images/avatar/2024/6/3/qNljtY1edz70ebJRCsvRisMfAfMHmib1PXtmRQJ7.png?width=50&height=50',
    date: '1404/08/20',
    content: """
      سلامت روان موضوعی است که در دنیای پرشتاب توسعه نرم‌افزار اغلب نادیده گرفته می‌شود، در حالی که درست به اندازه مهارت‌های فنی اهمیت دارد. بسیاری از برنامه‌نویسان ساعت‌های طولانی پشت سیستم می‌نشینند، با ددلاین‌های فشرده دست‌وپنجه نرم می‌کنند و درگیر پروژه‌هایی می‌شوند که گاهی هیچ مرزی میان کار و زندگی شخصی باقی نمی‌گذارند. نتیجه این فشارها می‌تواند چیزی باشد که به آن «فرسودگی شغلی» یا Burnout می‌گوییم؛ حالتی که نه‌تنها بهره‌وری را کاهش می‌دهد، بلکه انگیزه و شوق یادگیری را هم از بین می‌برد.
این مطلب با نگاهی کاربردی تلاش می‌کند به پرسشی ساده اما حیاتی پاسخ دهد: چگونه می‌توانیم به‌عنوان توسعه‌دهنده، از خودمان مراقبت کنیم و اجازه ندهیم فشارهای کاری سلامت روانمان را تهدید کند؟ در ادامه، هم نشانه‌های فرسودگی را مرور می‌کنیم و هم راهکارهایی عملی برای پیشگیری و مدیریت آن ارائه خواهیم داد؛ راهکارهایی که می‌توانند به ما کمک کنند تا هم در کار موفق‌تر باشیم و هم در زندگی آرام‌تر.      
    """,
    views: '1278',
    title: 'فرسودگی شغلی چیست و چه پیامدهایی برای کارمندان نسل زد دارد؟',
  ),

  BlogModel(
    id: 2,
    imageUrl:
        'https://static.digiato.com/digiato/2025/11/huawei-matepad-edge-tablet-mode-img33-910x576.jpg.webp',
    writer: 'حمید گنجی',
    writerImageUrl:
        'https://digiato.com/wp-content/uploads/avatars/308816-1751203566-32x32.jpg',
    date: '1404/07/21',
    content: """
      سلامت روان موضوعی است که در دنیای پرشتاب توسعه نرم‌افزار اغلب نادیده گرفته می‌شود، در حالی که درست به اندازه مهارت‌های فنی اهمیت دارد. بسیاری از برنامه‌نویسان ساعت‌های طولانی پشت سیستم می‌نشینند، با ددلاین‌های فشرده دست‌وپنجه نرم می‌کنند و درگیر پروژه‌هایی می‌شوند که گاهی هیچ مرزی میان کار و زندگی شخصی باقی نمی‌گذارند. نتیجه این فشارها می‌تواند چیزی باشد که به آن «فرسودگی شغلی» یا Burnout می‌گوییم؛ حالتی که نه‌تنها بهره‌وری را کاهش می‌دهد، بلکه انگیزه و شوق یادگیری را هم از بین می‌برد.
این مطلب با نگاهی کاربردی تلاش می‌کند به پرسشی ساده اما حیاتی پاسخ دهد: چگونه می‌توانیم به‌عنوان توسعه‌دهنده، از خودمان مراقبت کنیم و اجازه ندهیم فشارهای کاری سلامت روانمان را تهدید کند؟ در ادامه، هم نشانه‌های فرسودگی را مرور می‌کنیم و هم راهکارهایی عملی برای پیشگیری و مدیریت آن ارائه خواهیم داد؛ راهکارهایی که می‌توانند به ما کمک کنند تا هم در کار موفق‌تر باشیم و هم در زندگی آرام‌تر.      
    """,
    views: '988',
    title: 'منظور از فرسودگی شغلی چیه؟',
  ),

  BlogModel(
    id: 3,
    imageUrl:
        'https://static.digiato.com/digiato/2025/11/saudi-arabia-first-quantum-computer-%DB%B1-910x600.jpeg.webp',
    writer: 'آزاد کبیری',
    writerImageUrl:
        'https://digiato.com/wp-content/uploads/avatars/290164-32x32.jpeg',
    date: '1404/01/01',
    content: """
    برای شکستن الگوریتم‌های رمزنگاری فعلی (مانند ECC که بیت‌کوین از آن استفاده می‌کند) و اجرای الگوریتم شور به میلیون‌ها کیوبیت فیزیکی نیاز است تا بتوان خطاهای محاسباتی را اصلاح کرد. سیستم‌های فعلی هنوز با مشکل نویز و ناپایداری مواجه هستند؛ به این معنی که نمی‌توانند عملیات طولانی و دقیق لازم برای هک کلیدهای خصوصی کیف پول‌ها را انجام دهند.‌

    اگرچه ماشین فعلی عربستان خطری ندارد، اما پیشرفت این حوزه بسیار سریع است و مفهوم «روز کیو» را دوباره سر زبان‌ها انداخته است؛ روزی که کامپیوترهای کوانتومی آنقدر قدرتمند شوند که بتوانند تمام رمزنگاری‌های کلاسیک اینترنت را بشکنند.

    کارشناسان هشدار می‌دهند که این تهدید دیگر فقط تئوری نیست. اگرچه امروز امنیت همچنان برقرار است، اما دولت‌ها و هکرها ممکن است داده‌های رمزگذاری‌شده فعلی را ذخیره کنند تا در آینده (مثلاً ۱۰ سال دیگر) با کامپیوترهای قوی‌تر آنها را رمزگشایی کنند. به همین دلیل، رقابت کشورها برای رسیدن به برتری کوانتومی، نه فقط یک مسابقه علمی، بلکه تلاشی برای به‌دست‌آوردن یک سلاح دیجیتال جهانی است.

    """,
    views: '2199',
    title: 'شکستن الگوریتم های رمزنگاری',
  ),

  BlogModel(
    id: 4,
    imageUrl:
        'https://static.digiato.com/digiato/2025/11/nvidia1_1-910x600.jpg.webp',
    writer: 'جواد تاجی',
    writerImageUrl:
        'https://digiato.com/wp-content/uploads/avatars/353341-1749323231-32x32.jpg',
    date: '1399/04/31',
    content: """
      سلامت روان موضوعی است که در دنیای پرشتاب توسعه نرم‌افزار اغلب نادیده گرفته می‌شود، در حالی که درست به اندازه مهارت‌های فنی اهمیت دارد. بسیاری از برنامه‌نویسان ساعت‌های طولانی پشت سیستم می‌نشینند، با ددلاین‌های فشرده دست‌وپنجه نرم می‌کنند و درگیر پروژه‌هایی می‌شوند که گاهی هیچ مرزی میان کار و زندگی شخصی باقی نمی‌گذارند. نتیجه این فشارها می‌تواند چیزی باشد که به آن «فرسودگی شغلی» یا Burnout می‌گوییم؛ حالتی که نه‌تنها بهره‌وری را کاهش می‌دهد، بلکه انگیزه و شوق یادگیری را هم از بین می‌برد.
این مطلب با نگاهی کاربردی تلاش می‌کند به پرسشی ساده اما حیاتی پاسخ دهد: چگونه می‌توانیم به‌عنوان توسعه‌دهنده، از خودمان مراقبت کنیم و اجازه ندهیم فشارهای کاری سلامت روانمان را تهدید کند؟ در ادامه، هم نشانه‌های فرسودگی را مرور می‌کنیم و هم راهکارهایی عملی برای پیشگیری و مدیریت آن ارائه خواهیم داد؛ راهکارهایی که می‌توانند به ما کمک کنند تا هم در کار موفق‌تر باشیم و هم در زندگی آرام‌تر.      
    """,
    views: '1563',
    title: 'منظور از فرسودگی شغلی چیست؟',
  ),

  BlogModel(
    id: 5,
    imageUrl:
        'https://static.roocket.ir/images/cover/2024/2/27/b2RqrDLL9DOYBIigGFJOuRoZW6vx9M3ZnH9PlbkP.jpg',
    writer: 'عرفان کاکایی',
    writerImageUrl: 'https://roocket.ir/img/default.png?width=50&height=50',
    date: '1403/12/29',
    content: """
    PowerShell یک زبان اسکریپت‌نویسی و محیط خط فرمان (Command Line Interface || CLI) پیشرفته است که توسط مایکروسافت توسعه داده شده و برای اتوماسیون و مدیریت وظایف سیستمی در سیستم‌های مبتنی بر ویندوز طراحی شده است. این ابزار، که برای اولین بار در سال 2006 منتشر شد، در حال حاضر بخشی جدایی‌ناپذیر از مجموعه ابزارهای مدیریتی ویندوز است.

در این مطلب از وبسایت راکت قصد داریم شما را با ۲۰ دستور کاربردی و مفید در محیط پاورشل آشنا کنیم. اما قبل از آن بیایید کمی بیشتر با ویژگی‌های کلیدی پاورشل آشنا شویم.    
    """,
    views: '899',
    title: 'تاریخچه جالب CLI',
  ),

  BlogModel(
    id: 6,
    imageUrl:
        'https://static.digiato.com/digiato/2025/11/microsoft-cobalt-200-910x600.jpg.webp',
    writer: 'ایمان صاحبی',
    writerImageUrl:
        'https://digiato.com/wp-content/uploads/avatars/226797-32x32.jpg',
    date: '1401/05/25',
    content: """
      سلامت روان موضوعی است که در دنیای پرشتاب توسعه نرم‌افزار اغلب نادیده گرفته می‌شود، در حالی که درست به اندازه مهارت‌های فنی اهمیت دارد. بسیاری از برنامه‌نویسان ساعت‌های طولانی پشت سیستم می‌نشینند، با ددلاین‌های فشرده دست‌وپنجه نرم می‌کنند و درگیر پروژه‌هایی می‌شوند که گاهی هیچ مرزی میان کار و زندگی شخصی باقی نمی‌گذارند. نتیجه این فشارها می‌تواند چیزی باشد که به آن «فرسودگی شغلی» یا Burnout می‌گوییم؛ حالتی که نه‌تنها بهره‌وری را کاهش می‌دهد، بلکه انگیزه و شوق یادگیری را هم از بین می‌برد.
این مطلب با نگاهی کاربردی تلاش می‌کند به پرسشی ساده اما حیاتی پاسخ دهد: چگونه می‌توانیم به‌عنوان توسعه‌دهنده، از خودمان مراقبت کنیم و اجازه ندهیم فشارهای کاری سلامت روانمان را تهدید کند؟ در ادامه، هم نشانه‌های فرسودگی را مرور می‌کنیم و هم راهکارهایی عملی برای پیشگیری و مدیریت آن ارائه خواهیم داد؛ راهکارهایی که می‌توانند به ما کمک کنند تا هم در کار موفق‌تر باشیم و هم در زندگی آرام‌تر.      
    """,
    views: '1300',
    title: 'فرسودگی شغلی یعنی چه؟',
  ),

  BlogModel(
    id: 7,
    imageUrl:
        'https://static.digiato.com/digiato/2016/05/1464695387654_zotacmagnusen980.png.webp',
    writer: 'سینا گلستانه',
    writerImageUrl:
        'https://digiato.com/wp-content/uploads/avatars/28810-32x32.jpg',
    date: '1402/08/20',
    content: """
      سلامت روان موضوعی است که در دنیای پرشتاب توسعه نرم‌افزار اغلب نادیده گرفته می‌شود، در حالی که درست به اندازه مهارت‌های فنی اهمیت دارد. بسیاری از برنامه‌نویسان ساعت‌های طولانی پشت سیستم می‌نشینند، با ددلاین‌های فشرده دست‌وپنجه نرم می‌کنند و درگیر پروژه‌هایی می‌شوند که گاهی هیچ مرزی میان کار و زندگی شخصی باقی نمی‌گذارند. نتیجه این فشارها می‌تواند چیزی باشد که به آن «فرسودگی شغلی» یا Burnout می‌گوییم؛ حالتی که نه‌تنها بهره‌وری را کاهش می‌دهد، بلکه انگیزه و شوق یادگیری را هم از بین می‌برد.
این مطلب با نگاهی کاربردی تلاش می‌کند به پرسشی ساده اما حیاتی پاسخ دهد: چگونه می‌توانیم به‌عنوان توسعه‌دهنده، از خودمان مراقبت کنیم و اجازه ندهیم فشارهای کاری سلامت روانمان را تهدید کند؟ در ادامه، هم نشانه‌های فرسودگی را مرور می‌کنیم و هم راهکارهایی عملی برای پیشگیری و مدیریت آن ارائه خواهیم داد؛ راهکارهایی که می‌توانند به ما کمک کنند تا هم در کار موفق‌تر باشیم و هم در زندگی آرام‌تر.      
    """,
    views: '322',
    title: 'مینی کامپیوتر EN980 از برند Zotac',
  ),

  BlogModel(
    id: 8,
    imageUrl:
        'https://static.roocket.ir/images/cover/2025/10/23/y9empLC4uCiC7mtUvK7VSVMXyH2ZiQuKmcAZEo10.webp',
    writer: 'ارسطو عباسی',
    writerImageUrl:
        'https://static.roocket.ir/images/avatar/2024/6/3/qNljtY1edz70ebJRCsvRisMfAfMHmib1PXtmRQJ7.png?width=50&height=50',
    date: '1404/08/24',
    content: """
    با ورود هوش مصنوعی به عرصه توسعه نرم‌افزار، نگرانی‌های زیادی درباره آینده شغلی برنامه‌نویسان شکل گرفته است. یکی از مهم‌ترین تهدیدها، خودکار شدن وظایف تکراری است؛ کارهایی مثل نوشتن کدهای ساده، تولید توابع متداول یا حتی رفع برخی خطاها اکنون توسط ابزارهای هوشمند انجام می‌شوند. این موضوع می‌تواند باعث شود که در پروژه‌های کوچک یا استارتاپ‌ها، نیاز به نیروی انسانی کاهش یابد.

    از سوی دیگر، وابستگی بیش از حد به ابزارهای AI خطر از دست رفتن مهارت‌های بنیادی را به همراه دارد. اگر برنامه‌نویسان تنها به پیشنهادهای ماشین تکیه کنند، توانایی تحلیل الگوریتمی و درک عمیق از ساختار نرم‌افزار ممکن است کمرنگ شود.

    همچنین، رقابت در بازار کار شکل تازه‌ای پیدا می‌کند. شرکت‌ها به دنبال افرادی هستند که علاوه بر مهارت‌های کدنویسی، توانایی کار با ابزارهای هوش مصنوعی را داشته باشند. این یعنی کسانی که صرفاً به مهارت‌های سنتی تکیه کرده‌اند، ممکن است در آینده با چالش‌های بیشتری برای یافتن موقعیت شغلی مناسب روبه‌رو شوند.

    در نهایت، باید پذیرفت که هوش مصنوعی می‌تواند برخی نقش‌ها را تغییر دهد یا حتی حذف کند. اما این تنها یک روی سکه است؛ چرا که در کنار تهدیدها، فرصت‌های تازه‌ای نیز در حال شکل‌گیری‌اند.
    """,
    views: '512',
    title: 'ورود هوش مصنوعی به تکنولوژی',
  ),
];

List<PodCastModel> podCastList = [
  PodCastModel(
    id: 1,
    imageUrl: 'https://armindevelop.com/irancast/wp-content/uploads/2025/10/blog-image-podcast-spotify-263x171.jpg',
    title: 'رادیو تکنو',
    podcaster: 'اردوان اسکندری',
    podcasterImageUrl: 'https://armindevelop.com/irancast/wp-content/uploads/2025/10/sashmoradi-100x100.png',
    date: '1404/09/01',
    episodes: [
      {
        'episode' : "بخش اول",
        'name' : "پیداش کن",
        'duration' : "26:20"
      },
      {
        'episode' : "بخش دوم",
        'name' : "مذاکره تا تصاحب پروژه",
        'duration' : "23:00"
      },
      {
        'episode' : "بخش سوم",
        'name' : "کارفرمای عصبانی",
        'duration' : "25:33"
      },
      {
        'episode' : "بخش چهارم",
        'name' : "فریلنسر دیوانه",
        'duration' : "14:28"
      },
    ],
    listens: '178',
  ),

  PodCastModel(
    id: 2,
    imageUrl: 'https://armindevelop.com/irancast/wp-content/uploads/2025/10/podcast1.jpg',
    title: 'بوسه مرگ',
    podcaster: 'یگانه تقوانیا',
    podcasterImageUrl: 'https://armindevelop.com/irancast/wp-content/uploads/2025/10/bagheri-100x100.png',
    date: '1399/12/10',
    episodes: [
      {
        'episode' : "بخش اول",
        'name' : "پیداش کن",
        'duration' : "26:20"
      },
      {
        'episode' : "بخش دوم",
        'name' : "مذاکره تا تصاحب پروژه",
        'duration' : "23:00"
      },
      {
        'episode' : "بخش سوم",
        'name' : "کارفرمای عصبانی",
        'duration' : "25:33"
      },
      {
        'episode' : "بخش چهارم",
        'name' : "فریلنسر دیوانه",
        'duration' : "14:28"
      },
    ],
    listens: '999',
  ),

  PodCastModel(
    id: 3,
    imageUrl: 'https://armindevelop.com/irancast/wp-content/uploads/2025/10/images.jpg',
    title: 'تاثیر عزت نفس در موفقیت',
    podcaster: 'ملیکا عزیزی',
    podcasterImageUrl: 'https://armindevelop.com/irancast/wp-content/uploads/2025/11/pngtree-businessman-user-avatar-wearing-suit-with-red-tie-png-image_5809521.png',
    date: '1400/09/01',
    episodes: [
      {
        'episode' : "بخش اول",
        'name' : "پیداش کن",
        'duration' : "26:20"
      },
      {
        'episode' : "بخش دوم",
        'name' : "مذاکره تا تصاحب پروژه",
        'duration' : "23:00"
      },
      {
        'episode' : "بخش سوم",
        'name' : "کارفرمای عصبانی",
        'duration' : "25:33"
      },
      {
        'episode' : "بخش چهارم",
        'name' : "فریلنسر دیوانه",
        'duration' : "14:28"
      },
    ],
    listens: '1193',
  ),

  PodCastModel(
    id: 4,
    imageUrl: 'https://armindevelop.com/irancast/wp-content/uploads/2025/10/1593002543-pirate-podcast-images-16-600x400.jpg',
    title: 'زبان بدن؛ قدرت واقعی یک انسان زنده',
    podcaster: 'جواد خاکپور',
    podcasterImageUrl: 'https://armindevelop.com/irancast/wp-content/uploads/2025/11/pngtree-businessman-user-avatar-wearing-suit-with-red-tie-png-image_5809521.png',
    date: '1402/09/01',
    episodes: [
      {
        'episode' : "بخش اول",
        'name' : "پیداش کن",
        'duration' : "26:20"
      },
      {
        'episode' : "بخش دوم",
        'name' : "مذاکره تا تصاحب پروژه",
        'duration' : "23:00"
      },
      {
        'episode' : "بخش سوم",
        'name' : "کارفرمای عصبانی",
        'duration' : "25:33"
      },
      {
        'episode' : "بخش چهارم",
        'name' : "فریلنسر دیوانه",
        'duration' : "14:28"
      },
    ],
    listens: '2566',
  ),

  PodCastModel(
    id: 5,
    imageUrl: 'https://armindevelop.com/irancast/wp-content/uploads/2025/10/post2.png',
    title: 'شروع مسیر پادکست؛ آغازی از جنس نو',
    podcaster: 'اردوان اسکندری',
    podcasterImageUrl: 'https://armindevelop.com/irancast/wp-content/uploads/2025/10/sashmoradi-100x100.png',
    date: '1403/09/01',
    episodes: [
      {
        'episode' : "بخش اول",
        'name' : "پیداش کن",
        'duration' : "26:20"
      },
      {
        'episode' : "بخش دوم",
        'name' : "مذاکره تا تصاحب پروژه",
        'duration' : "23:00"
      },
      {
        'episode' : "بخش سوم",
        'name' : "کارفرمای عصبانی",
        'duration' : "25:33"
      },
      {
        'episode' : "بخش چهارم",
        'name' : "فریلنسر دیوانه",
        'duration' : "14:28"
      },
    ],
    listens: '5369',
  ),
];